# Comprehensive Guide to Combining DataFrames: Concatenation, Merging, and Joining

Pandas provides several powerful methods for combining DataFrames, each serving different purposes. Let's explore these techniques with clear explanations and practical examples.

____

## Concatenation: Stacking DataFrames Vertically or Horizontally
Concatenation is the simplest way to combine DataFrames by stacking them either vertically (axis=0) or horizontally (axis=1). This is ideal when DataFrames have the same columns (for vertical) or same indexes (for horizontal).

**Example DataFrames**

In [7]:
import pandas as pd

In [9]:
df1 = pd.DataFrame({
    'Product': ['Laptop', 'Tablet', 'Phone', 'Monitor'],
    'Price': [1200, 350, 800, 250],
    'Stock': [15, 30, 45, 20]
}, index=[0, 1, 2, 3])

df2 = pd.DataFrame({
    'Product': ['Keyboard', 'Mouse', 'Printer', 'Scanner'],
    'Price': [80, 25, 150, 200],
    'Stock': [50, 100, 25, 30]
}, index=[4, 5, 6, 7])

df3 = pd.DataFrame({
    'Product': ['Headphones', 'Speaker', 'Webcam', 'Microphone'],
    'Price': [150, 120, 80, 60],
    'Stock': [40, 25, 60, 35]
}, index=[8, 9, 10, 11])

In [11]:
df1

   Product  Price  Stock
0   Laptop   1200     15
1   Tablet    350     30
2    Phone    800     45
3  Monitor    250     20

In [13]:
df2

    Product  Price  Stock
4  Keyboard     80     50
5     Mouse     25    100
6   Printer    150     25
7   Scanner    200     30

In [15]:
df3

       Product  Price  Stock
8   Headphones    150     40
9      Speaker    120     25
10      Webcam     80     60
11  Microphone     60     35

## Basic Concatenation:


Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [20]:
inventory_df = pd.concat([df1, df2, df3])
display(inventory_df)

       Product  Price  Stock
0       Laptop   1200     15
1       Tablet    350     30
2        Phone    800     45
3      Monitor    250     20
4     Keyboard     80     50
5        Mouse     25    100
6      Printer    150     25
7      Scanner    200     30
8   Headphones    150     40
9      Speaker    120     25
10      Webcam     80     60
11  Microphone     60     35

## Horizontal Concatenation:

In [25]:
# Create DataFrames with same index but different columns
df_features = pd.DataFrame({
    'Weight': [1.5, 0.7, 0.2, 3.2],
    'Warranty': [2, 1, 1, 3]
}, index=[0, 1, 2, 3])

df_sales = pd.DataFrame({
    'Monthly_Sales': [120, 250, 400, 80],
    'Return_Rate': [0.02, 0.01, 0.03, 0.05]
}, index=[0, 1, 2, 3])

# Combine horizontally
product_info = pd.concat([df1, df_features, df_sales], axis=1)
display(product_info)

   Product  Price  Stock  Weight  Warranty  Monthly_Sales  Return_Rate
0   Laptop   1200     15     1.5         2            120         0.02
1   Tablet    350     30     0.7         1            250         0.01
2    Phone    800     45     0.2         1            400         0.03
3  Monitor    250     20     3.2         3             80         0.05

## Merging: Combining DataFrames Based on Common Columns

Merging is similar to SQL joins, where DataFrames are combined based on common keys or columns. This is powerful for combining related datasets.

**Example DataFrames:**

In [29]:
# Customer information
customers = pd.DataFrame({
    'CustomerID': ['C001', 'C002', 'C003', 'C004'],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Email': ['alice@email.com', 'bob@email.com', 'charlie@email.com', 'diana@email.com']
})

# Order information
orders = pd.DataFrame({
    'OrderID': ['O1001', 'O1002', 'O1003', 'O1004'],
    'CustomerID': ['C001', 'C003', 'C001', 'C005'],
    'Amount': [150.50, 89.99, 240.00, 75.25],
    'Date': ['2023-01-15', '2023-01-16', '2023-01-18', '2023-01-20']
})

In [31]:
display(customers)

  CustomerID     Name              Email
0       C001    Alice    alice@email.com
1       C002      Bob      bob@email.com
2       C003  Charlie  charlie@email.com
3       C004    Diana    diana@email.com

In [33]:
display(orders)

  OrderID CustomerID  Amount        Date
0   O1001       C001  150.50  2023-01-15
1   O1002       C003   89.99  2023-01-16
2   O1003       C001  240.00  2023-01-18
3   O1004       C005   75.25  2023-01-20

### Types of Merges:

#### Inner Merge (default) - Only matching rows:

In [37]:
pd.merge(customers, orders, on='CustomerID')

  CustomerID     Name              Email OrderID  Amount        Date
0       C001    Alice    alice@email.com   O1001  150.50  2023-01-15
1       C001    Alice    alice@email.com   O1003  240.00  2023-01-18
2       C003  Charlie  charlie@email.com   O1002   89.99  2023-01-16

#### Left Merge - All rows from left DataFrame:

In [40]:
pd.merge(customers, orders, on='CustomerID', how='left')

  CustomerID     Name              Email OrderID  Amount        Date
0       C001    Alice    alice@email.com   O1001  150.50  2023-01-15
1       C001    Alice    alice@email.com   O1003  240.00  2023-01-18
2       C002      Bob      bob@email.com     NaN     NaN         NaN
3       C003  Charlie  charlie@email.com   O1002   89.99  2023-01-16
4       C004    Diana    diana@email.com     NaN     NaN         NaN

#### Right Merge - All rows from right DataFrame:

In [43]:
pd.merge(customers, orders, on='CustomerID', how='right')

  CustomerID     Name              Email OrderID  Amount        Date
0       C001    Alice    alice@email.com   O1001  150.50  2023-01-15
1       C003  Charlie  charlie@email.com   O1002   89.99  2023-01-16
2       C001    Alice    alice@email.com   O1003  240.00  2023-01-18
3       C005      NaN                NaN   O1004   75.25  2023-01-20

#### Outer Merge - All rows from both DataFrames:

In [46]:
pd.merge(customers, orders, on='CustomerID', how='outer')

  CustomerID     Name              Email OrderID  Amount        Date
0       C001    Alice    alice@email.com   O1001  150.50  2023-01-15
1       C001    Alice    alice@email.com   O1003  240.00  2023-01-18
2       C002      Bob      bob@email.com     NaN     NaN         NaN
3       C003  Charlie  charlie@email.com   O1002   89.99  2023-01-16
4       C004    Diana    diana@email.com     NaN     NaN         NaN
5       C005      NaN                NaN   O1004   75.25  2023-01-20

### Merging on Multiple Keys:

In [49]:
# Employee information
employees = pd.DataFrame({
    'Department': ['Sales', 'Sales', 'IT', 'HR', 'IT'],
    'EmployeeID': ['E001', 'E002', 'E003', 'E004', 'E005'],
    'Name': ['John', 'Jane', 'Mike', 'Sarah', 'David']
})

# Performance ratings
performance = pd.DataFrame({
    'Department': ['Sales', 'IT', 'IT', 'HR', 'Marketing'],
    'EmployeeID': ['E001', 'E003', 'E005', 'E004', 'E006'],
    'Rating': [4.5, 3.8, 4.2, 4.0, 3.9]
})

In [51]:
employees

  Department EmployeeID   Name
0      Sales       E001   John
1      Sales       E002   Jane
2         IT       E003   Mike
3         HR       E004  Sarah
4         IT       E005  David

In [53]:
performance

  Department EmployeeID  Rating
0      Sales       E001     4.5
1         IT       E003     3.8
2         IT       E005     4.2
3         HR       E004     4.0
4  Marketing       E006     3.9

In [55]:
# Merge on both department and employee ID
pd.merge(employees, performance, on=['Department', 'EmployeeID'], how='left')

  Department EmployeeID   Name  Rating
0      Sales       E001   John     4.5
1      Sales       E002   Jane     NaN
2         IT       E003   Mike     3.8
3         HR       E004  Sarah     4.0
4         IT       E005  David     4.2

## 3. Joining: Combining DataFrames Based on Index

Joining is similar to merging but uses indexes instead of columns to combine DataFrames. It's particularly useful when working with time series data or when indexes carry meaningful information.

In [59]:
# Company quarterly reports
q1 = pd.DataFrame({
    'Revenue': [100000, 120000, 95000],
    'Expenses': [70000, 75000, 65000]
}, index=['ProductA', 'ProductB', 'ProductC'])

q2 = pd.DataFrame({
    'Revenue': [110000, 125000, 105000],
    'Expenses': [72000, 78000, 70000]
}, index=['ProductA', 'ProductB', 'ProductD'])

# Employee count per product
employees = pd.DataFrame({
    'Team_Size': [15, 12, 8, 10]
}, index=['ProductA', 'ProductB', 'ProductC', 'ProductD'])

In [61]:
q1

          Revenue  Expenses
ProductA   100000     70000
ProductB   120000     75000
ProductC    95000     65000

In [63]:
q2

          Revenue  Expenses
ProductA   110000     72000
ProductB   125000     78000
ProductD   105000     70000

In [65]:
employees

          Team_Size
ProductA         15
ProductB         12
ProductC          8
ProductD         10

### Basic Join:

In [68]:
# Default left join on index
q1.join(employees)

          Revenue  Expenses  Team_Size
ProductA   100000     70000         15
ProductB   120000     75000         12
ProductC    95000     65000          8

### Inner Join - Only matching indexes:

In [71]:
q1.join(q2, how='inner', lsuffix='_Q1', rsuffix='_Q2')

          Revenue_Q1  Expenses_Q1  Revenue_Q2  Expenses_Q2
ProductA      100000        70000      110000        72000
ProductB      120000        75000      125000        78000

### Outer Join - All indexes from both DataFrames:

In [74]:
q1.join(q2, how='outer', lsuffix='_Q1', rsuffix='_Q2')

          Revenue_Q1  Expenses_Q1  Revenue_Q2  Expenses_Q2
ProductA    100000.0      70000.0    110000.0      72000.0
ProductB    120000.0      75000.0    125000.0      78000.0
ProductC     95000.0      65000.0         NaN          NaN
ProductD         NaN          NaN    105000.0      70000.0

### Right Join - All indexes from right DataFrame:

In [77]:
q1.join(employees, how='right')

           Revenue  Expenses  Team_Size
ProductA  100000.0   70000.0         15
ProductB  120000.0   75000.0         12
ProductC   95000.0   65000.0          8
ProductD       NaN       NaN         10

# Summary

| Method        | Best For                                | Key Parameter | Primary Use Case                     |
|---------------|-----------------------------------------|---------------|---------------------------------------|
| Concatenation | Stacking identical DataFrames          | `axis`        | Combining similar data from sources   |
| Merging       | SQL-like joins based on columns         | `on`, `how`   | Combining related datasets            |
| Joining       | Combining based on index alignment      | `how`         | Time series or index-based operations |

# Practical Tips:

- Handle Duplicate Columns: Use suffixes parameter in merge/join to distinguish same-named columns.

- Check Merge Results: Always verify row counts after merging to ensure expected behavior.

- Performance: For large DataFrames, merging on indexes is generally faster than on columns.

- Multi-index: All these operations work with multi-index DataFrames as well.

By mastering these three techniques, you'll be able to handle virtually any data combination task in pandas efficiently!